Autodesk.Revit.DB.Architecture.TopographyLinkType.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.LinkLoadResult@)
Creates a new Topography link type.
adoc:
The document in which to create the Topography Link.
path:
The path of the link file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
adoc is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
Fail to access the link file.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2019.2